#!/usr/bin/env python
# linux系统下   这一行是必须写的，它能够引导程序找到python的解析器，也就是说，不管你这个文件保存在什么地方，这个程序都能执行，而不用制定python的安装路径。

#coding:utf-8
# 本程序采用的编码格式是utf-8，什么是编码？什么是utf-8？这是一个比较复杂且有历史的问题，此处暂不讨论。只有有了上面这句话，后面的程序中才能写汉字，否则就会报错了。看官可以把你的程序中的这行删掉，看看什么结果？



import platform
print("Tho current version of  python is "+platform.python_version())

# id()  获取数据的内存地址，built-in Function 内建函数
print(id(3.333333333333333333333333333333333333333333333333333333333333333))

# type()  获取对象的类型
print(type(3))

# 变量：对象有类型，变量无类型。（python是动态语言）
x = 4;
print(x)

# 四则运算
print(0.1 + 0.2)
print(0.1 + 0.1 - 0.2)
print(0.1 + 0.1 + 0.1 - 0.3)
print(0.1 + 0.1 + 0.1 - 0.2)
print(4.0 + 2.0)
print(4.0 * 2.0)
print(4.0 * 2)
print(4 * 2)
print(12345678987098765432112234344556767889009887612334556677899900998765433323876654433455661234567898709876543211223434455676788900988761233455667789990099876543332387665443345566*123345566778999009987654333238766544334556612334556677899900998765433323876654433455661234567898709876543211223434455676788900988761233455667789990099876543332387665443345566)
print(2.0/5.0)
print(2.0/5)
print(2/5.0)
print(2/5)
print(5/2)
print(10/3)
print(4/2)
print(4/2)
print("如何数据在四则运算下得到精确的结果？")
print(divmod(5,2))
print(divmod(5.0,2))
print( round(1.234567,2))
print(round(1.234567,3))
print(round(10.0/3,4))


a = 19+2*4-8/2
print(a)