# -*- coding:utf-8 -*-

"""
@Function:
@File    :          fontToolsTest2.py    
@Contact :          lizhou@glorypty.com
@License :          (C)Copyright 2019-2020

@Modify Time        @Author      @Version        @Desciption
------------        -------      --------        -----------
2019-6-5 14:34     lizhou         1.0

"""

from fontTools.ttLib import TTFont

# 第一次获得的字体文件,用fontCreator打开后，截图，用百度OCR识别出中文
# 冀 末 王
jgp_word_list = ['史', '东', '录', '书', '周', '网', '毛', '范', '统', '所', '微', '成', '印', '机', '于', '开', '复', '载',
             '业', '名', '地', '善', '期', '堡', '列', '田', '脸', '据', '得', '敌', '第', '积', '洁', '欢', '九', '沉',
             '央', '点', '家', '聚', '系', '件', '光', '黄', '义', '魂', '鞋', '活', '兵', '指', '听', '补', '部', '飞',
             '用', '线', '新', '精', '红', '黑', '行', '何', '头', '下', '伦', '市', '展', '性', '设', '要', '克', '军',
             '顶', '里', '大', '失', '乐', '质', '都', '企', '马', '端', '吾', '版', '团', '参', '改', '络', '历', '术',
             '极', '群', '注', '工', '人', '搜', '首', '加', '化', '传', '页', '盒', '量', '党', '通', '主', '论', '张',
             '建', '文', '渔', '津', '退', '众', '海', '廉', '凰', '错', '认', '科', '坛', '具', '频', '热', '选', '发',
             '为', '担', '先', '好', '准', '斯', '革', '弘', '软', '腾', '聘', '深', '当', '有', '度', '厅', '经', '西',
             '无', '不', '牌', '民', '时', '其', '密', '计', '湾', '型', '对', '酷', '我', '产', '典', '本', '电', '近',
             '扫', '讲', '德', '转', '遗', '务', '锋', '祠', '皮', '体', '布', '思', '穿', '规', '款', '责', '推', '态',
             '六', '报', '共', '平', '去', '招', '习', '闻', '定', '讯', '续', '凤', '农', '泽', '关', '华', '挂', '息',
             '宽', '康', '存', '调', '排', '巴', '属', '胡', '七', '引', '理', '拥', '赢', '国', '阿', '舆', '信', '数',
             '抱', '变', '窗', '冀', '绩', '荐', '律', '届', '多', '区', '利', '除', '中', '站', '正', '卫', '代', '知',
             '客', '会', '狗', '决', '办', '淀', '南', '面', '同', '役', '请', '顿', '与', '梦', '动', '想', '明', '李',
             '外', '高', '来', '视', '天', '收', '在', '更', '之', '坚', '践', '日', '示', '府', '洛', '财', '公', '幕',
             '悬', '告', '宣', '承', '临', '扎', '绿', '的', '见', '学', '层', '涯', '优', '省', '广', '末', '城', '能',
             '说', '神', '铁', '修', '困', '强', '程', '争', '负', '个', '申', '字', '常', '哲', '协', '命', '北', '户',
             '汉', '权', '入', '社', '音', '管', '境', '法', '裁', '云', '持', '育', '百', '浙', '犯', '藏', '源', '疆',
             '局', '步', '迎', '政', '土', '资', '标', '事', '如', '丽', '登', '作', '膀', '江', '荣', '治', '十', '位',
             '涉', '博', '技', '赋', '埃', '移', '干', '服', '水', '夫', '素', '做', '制', '艺', '亲', '舟', '情', '臂',
             '健', '勇', '控', '贸', '单', '园', '台', '任', '竞', '浪', '远', '集', '血', '生', '方', '扬', '欧', '狐',
             '恶', '全', '年', '吸', '委', '简', '进', '专', '总', '波', '上', '员', '山']




# 第二次获得的字体文件,用fontCreator打开后，截图，用百度OCR识别出中文
# 翼 未 士
png_word_list = ['区', '得', '顶', '频', '胡', '新', '见', '皮', '津', '毛', '登', '利', '梦', '人', '山', '调', '马', '赋', '政', '第', '移', '软', '版', '遗', '百', '民', '集', '正', '来', '幕', '头', '社', '思', '总', '台', '顿', '位', '善', '户', '赢', '极', '神', '进', '水', '财', '华', '示', '服', '印', '生', '酷', '办', '困', '法', '荐', '康', '电', '统', '性', '局', '件', '计', '理', '讯', '告', '七', '规', '务', '欢', '泽', '型', '深', '申', '亲', '浪', '窗', '复', '任', '面', '属', '去', '修', '团', '广', '担', '外', '个', '积', '想', '卫', '国', '术', '于', '高', '扬', '事', '其', '飞', '转', '淀', '脸', '欧', '权', '迎', '补', '荣', '贸', '舆', '有', '冀', '开', '臂', '西', '拥', '腾', '单', '远', '大', '魂', '息', '斯', '央', '恶', '用', '请', '首', '全', '阿', '下', '常', '黄', '文', '站', '挂', '专', '铁', '廉', '抱', '坚', '时', '搜', '舟', '藏', '闻', '委', '布', '端', '字', '引', '度', '学', '机', '说', '里', '点', '企', '范', '招', '牌', '化', '役', '府', '巴', '认', '地', '络', '境', '素', '历', '动', '产', '农', '传', '书', '定', '责', '员', '我', '作', '云', '湾', '狗', '宣', '制', '资', '多', '具', '程', '续', '园', '建', '控', '数', '敌', '改', '疆', '量', '在', '天', '客', '先', '标', '涯', '涉', '信', '竞', '技', '代', '周', '通', '共', '习', '浙', '兵', '群', '海', '存', '主', '质', '微', '绩', '裁', '会', '据', '层', '渔', '洛', '管', '坛', '退', '如', '排', '负', '盒', '狐', '名', '视', '丽', '知', '经', '南', '论', '九', '无', '博', '日', '健', '好', '之', '军', '江', '犯', '东', '听', '方', '推', '对', '准', '堡', '末', '发', '失', '讲', '成', '宽', '承', '六', '年', '穿', '步', '优', '光', '近', '做', '临', '网', '黑', '城', '绿', '十', '强', '简', '协', '页', '北', '行', '伦', '公', '命', '情', '中', '入', '精', '热', '革', '变', '党', '吸', '李', '扫', '沉', '收', '凰', '义', '密', '膀', '家', '祠', '锋', '系', '悬', '德', '埃', '音', '录', '都', '汉', '更', '不', '乐', '凤', '期', '款', '波', '要', '血', '设', '聚', '所', '线', '同', '当', '土', '体', '明', '夫', '报', '吾', '展', '参', '勇', '届', '为', '律', '能', '持', '红', '指', '克', '史', '的', '哲', '众', '加', '决', '业', '何', '关', '注', '扎', '与', '洁', '治', '科', '选', '省', '艺', '错', '争', '张', '载', '弘', '厅', '列', '上', '本', '除', '工', '市', '践', '鞋', '聘', '部', '态', '典', '活', '干', '育', '平', '田', '源']

# 得到两次请求的字体文件后，开始截图，做文字识别，比对文字是否匹配(百度OCR识别率没有100%，特别是近似字)
# for j in jgp_word_list:
#     match = False
#     for p in png_word_list:
#         if j == p :
#             # print(j,":" ,p)
#             match = True
#     if not match:
#         print("未匹配到的文字：",j)




font = TTFont('1_1.woff')
# 读取字体的映射关系
uni_list = font['cmap'].tables[0].ttFont.getGlyphOrder() # 参数'cmap' 表示汉字对应的映射 为unicode编码
print(uni_list)
# 打印的结果为：['.notdef', 'uniECD5', 'uniEC83', 'uniED37', 'uniECE5', 'uniED98', 'uniEC58', 'uniEDFA', 'uniECB9', 'uniED6D', 'uniED1B', 'uniEDCE', 'uniED7D', 'uniEC3C', 'uniECEF', 'uniEC9E', 'uniED51', 'uniEE04', 'uniEDB3', 'uniEC72', 'uniEC20', 'uniECD4', 'uniED87', 'uniED35', 'uniEDE9', 'uniECA8', 'uniEC56', 'uniED0A', 'uniECB8', 'uniED6B', 'uniEC2B', 'uniEDCD', 'uniEC8C', 'uniED40', 'uniECEE', 'uniEDA1', 'uniED4F', 'uniEE03', 'uniECC2']
# 需要注意的是：.notdef 并不是汉字的映射， 而是表示字体家族名称。真实数据是从下标 1 开始。
font_dic = {}
for unicode,words  in zip(uni_list[4:],jgp_word_list):
    print(unicode,":",words)
    font_dic[unicode] = words
print(font_dic)

# 得到字典
# {'uni50F3': '机', 'uni5268': '堡', 'uni6A46': '不', 'uni66F8': '有', 'uni5C65': '参', 'uni5287': '脸', 'uni9900': '欧', 'uni8C5E': '浙', 'uni99B6': '全', 'uni92B1': '赋', 'uni760B': '七', 'uni7D01': '代', 'uni9748': '远', 'uni51A9': '善', 'uni9B26': '委', 'uni7CFE': '卫', 'uni9581': '亲', 'uni5B24': '都', 'uni8CE2': '藏', 'uni993B': '狐', 'uni5B3F': '企', 'uni63D7': '发', 'uni723F': '凤', 'uni55FC': '义', 'uni4E41': '东', 'uni6F75': '体', 'uni5D54': '注', 'uni8219': '天', 'uni7104': '去', 'uni30EB': '史', 'uni62F9': '频', 'uni4E67': '录', 'uni527C': '列', 'uni514E': '业', 'uni761A': '引', 'uni52FC': '得', 'uni5664': '听', 'uni740E': '宽', 'uni6E53': '近', 'uni854F': '铁', 'uni6E4F': '电', 'uni68FC': '经', 'uni8C09': '百', 'uni4ECF': '网', 'uni9D3B': '简', 'uni6373': '热', 'uni5C4D': '吾', 'uni88D1': '户', 'uni967B': '控', 'uni5704': '线', 'uni5C64': '团', 'uni820E': '视', 'uni56EE': '用', 'uni8FA4': '事', 'uni6FA4': '穿', 'uni96E3': '园', 'uni5A6B': '克', 'uni971A': '台', 'uni8459': '的', 'uni5E51': '加', 'uni8452': '绿', 'uni98DC': '扬', 'uni58FD': '伦', 'uni8CEA': '源', 'uni5924': '展', 'uni75CC': '胡', 'uni7CE7': '正', 'uni7375': '挂', 'uni7DDA': '客', 'uni6228': '认', 'uni9223': '涉', 'uni59A0': '设', 'uni735E': '华', 'uni5D2B': '极', 'uni9154': '治', 'uni964F': '勇', 'uni7EA9': '南', 'uni6098': '主', 'uni7D25': '知', 'uni5EDA': '化', 'uni6E54': '扫', 'uni8DAB': '步', 'uni76EC': '阿', 'uni8846': '协', 'uni883B': '哲', 'uni6A53': '民', 'uni82D0': '更', 'uni5394': '敌', 'uni8AA6': '管', 'uni805E': '梦', 'uni52D9': '据', 'uni61DE': '廉', 'uni54CB': '欢', 'uni6A74': '时', 'uni9021': '丽', 'uni8956': '权', 'uni81A9': '明', 'uni5AB4': '里', 'uni66F1': '当', 'uni9682': '贸', 'uni5C05': '端', 'uni8509': '能', 'uni6702': '度', 'uni92B3': '埃', 'uni8889': '北', 'uni6FE0': '责', 'uni9D8F': '总', 'uni84F7': '末', 'uni9D70': '专', 'uni6F4E': '皮', 'uni802A': '顿', 'uni7A35': '窗', 'uni6688': '聘', 'uni5399': '第', 'uni616E': '津', 'uni6230': '坛', 'uni91FF': '位', 'uni63F9': '为', 'uni616C': '渔', 'uni7A4D': '冀', 'uni4F7E': '统', 'uni83AE': '幕', 'uni6FC6': '规', 'uni6B6F': '计', 'uni7DE9': '会', 'uni7F15': '面', 'uni5D7B': '人', 'uni5A88': '军', 'uni5147': '载', 'uni9322': '水', 'uni998F': '恶', 'uni5ACA': '大', 'uni6503': '准', 'uni82F8': '坚', 'uni4E82': '书', 'uni9272': '技', 'uni8FC9': '如', 'uni5905': '市', 'uni855C': '强', 'uni9E7D': '波', 'uni74AA': '调', 'uni7027': '报', 'uni7E8C': '淀', 'uni8D9A': '局', 'uni8932': '汉', 'uni96A2': '单', 'uni5AFC': '乐', 'uni5716': '精', 'uni6EAB': '讲', 'uni84DC': '省', 'uni5F75': '盒', 'uni5521': '沉', 'uni7662': '拥', 'uni5AE7': '失', 'uni769B': '赢', 'uni8742': '申', 'uni5B4C': '马', 'uni4FE5': '所', 'uni743A': '康', 'uni5AA8': '顶', 'uni83C8': '悬', 'uni84C8': '优', 'uni6F4D': '祠', 'uni6BF3': '型', 'uni54FE': '九', 'uni5837': '头', 'uni6E31': '本', 'uni53C3': '积', 'uni6FF1': '推', 'uni82A2': '在', 'uni9301': '干', 'uni95E1': '健', 'uni8AF4': '裁', 'uni831A': '日', 'uni751E': '属', 'uni885E': '命', 'uni838B': '财', 'uni4F71': '范', 'uni7BFE': '区', 'uni8443': '扎', 'uni5A3F': '要', 'uni9134': '荣', 'uni5614': '鞋', 'uni79B8': '变', 'uni6FD5': '款', 'uni8B8A': '育', 'uni850E': '说', 'uni5604': '魂', 'uni50FD': '于', 'uni8550': '修', 'uni5F61': '页', 'uni8355': '府', 'uni6473': '先', 'uni87BA': '常', 'uni8ADF': '法', 'uni5619': '活', 'uni82DD': '之', 'uni5638': '兵', 'uni8F75': '标', 'uni8EDF': '政', 'uni720D': '续', 'uni9055': '膀', 'uni516F': '名', 'uni9721': '任', 'uni7CD8': '站', 'uni5258': '期', 'uni60A1': '论', 'uni9AD2': '吸', 'uni87A1': '字', 'uni83A3': '公', 'uni61F2': '凰', 'uni5121': '开', 'uni6518': '斯', 'uni5283': '田', 'uni55F9': '光', 'uni8DAC': '迎', 'uni9743': '浪', 'uni8B6F': '持', 'uni67C2': '厅', 'uni5C5F': '版', 'uni61F7': '错', 'uni7F1E': '同', 'uni8ACD': '境', 'uni847E': '层', 'uni6F80': '布', 'uni5642': '指', 'uni5138': '复', 'uni8278': '收', 'uni904B': '作', 'uni5525': '央', 'uni9798': '血', 'uni567A': '补', 'uni81E5': '外', 'uni55F1': '件', 'uni5980': '性', 'uni78A5': '信', 'uni765F': '理', 'uni571C': '黑', 'uni6649': '腾', 'uni846E': '见', 'uni6FFA': '态', 'uni60BB': '建', 'uni5CBD': '络', 'uni9773': '集', 'uni7C85': '中', 'uni737B': '息', 'uni85D9': '负', 'uni85CD': '争', 'uni5F1C': '传', 'uni7F85': '役', 'uni8A01': '社', 'uni6191': '众', 'uni86EC': '个', 'uni66AB': '深', 'uni7278': '农', 'uni70A1': '平', 'uni938D': '做', 'uni7E23': '决', 'uni820A': '来', 'uni9867': '方', 'uni6D55': '产', 'uni7AF6': '荐', 'uni6DE5': '典', 'uni834D': '示', 'uni8F44': '资', 'uni6B61': '密', 'uni8F25': '土', 'uni64FE': '好', 'uni9F21': '员', 'uni6A47': '牌', 'uni8D7D': '疆', 'uni8980': '入', 'uni843F': '临', 'uni58DE': '下', 'uni9D6C': '进', 'uni5D36': '群', 'uni6EE6': '德', 'uni8420': '宣', 'uni959E': '臂', 'uni8388': '洛', 'uni745D': '存', 'uni6105': '文', 'uni9336': '夫', 'uni63B1': '选', 'uni4EBE': '周', 'uni5D7F': '搜', 'uni74D2': '排', 'uni79A2': '抱', 'uni842A': '承', 'uni9729': '竞', 'uni7197': '讯', 'uni8500': '城', 'uni622E': '科', 'uni7BDC': '多', 'uni91E2': '十', 'uni814E': '想', 'uni5D57': '工', 'uni6F22': '务', 'uni65EA': '软', 'uni7C06': '利', 'uni7171': '习', 'uni617E': '退', 'uni5588': '家', 'uni99BF': '年', 'uni76E7': '国', 'uni55AA': '聚', 'uni701C': '六', 'uni74DE': '巴', 'uni5045': '微', 'uni97FB': '生', 'uni6464': '担', 'uni7B9B': '律', 'uni5B0C': '质', 'uni60AA': '张', 'uni9F70': '山', 'uni65E3': '弘', 'uni7BA0': '届', 'uni55FB': '黄', 'uni734C': '关', 'uni8209': '高', 'uni783D': '舆', 'uni72CC': '泽', 'uni9584': '舟', 'uni5DDF': '首', 'uni5072': '成', 'uni9528': '制', 'uni8103': '动', 'uni5767': '何', 'uni904A': '登', 'uni7177': '闻', 'uni6046': '量', 'uni5CEE': '历', 'uni8A2C': '音', 'uni7151': '招', 'uni703B': '共', 'uni5098': '印', 'uni92D6': '移', 'uni7C80': '除', 'uni6CB0': '对', 'uni5CEF': '术', 'uni6AAD': '其', 'uni84F3': '广', 'uni6F34': '锋', 'uni841C': '告', 'uni619B': '海', 'uni6569': '革', 'uni6CB5': '酷', 'uni8520': '神', 'uni53D2': '洁', 'uni8569': '程', 'uni81D8': '李', 'uni6BB8': '湾', 'uni923D': '博', 'uni6943': '西', 'uni7E02': '狗', 'uni8554': '困', 'uni4EEF': '毛', 'uni55B2': '系', 'uni570B': '新', 'uni608A': '通', 'uni8306': '践', 'uni9084': '江', 'uni847F': '涯', 'uni8472': '学', 'uni5C7E': '改', 'uni931E': '服', 'uni6EFD': '转', 'uni7FB1': '请', 'uni6D38': '我', 'uni552B': '点', 'uni5718': '红', 'uni8045': '与', 'uni718B': '定', 'uni6A39': '无', 'uni7ABF': '绩', 'uni56C9': '部', 'uni8CD7': '犯', 'uni62E1': '具', 'uni78C6': '数', 'uni7E2E': '办', 'uni5731': '行', 'uni56E9': '飞', 'uni8B58': '云', 'uni956C': '艺', 'uni9385': '素', 'uni6F11': '遗', 'uni604F': '党', 'uni9EA5': '上', 'uni6F95': '思', 'uni9599': '情', 'uni5172': '地'}




